In [1]:
import pandas as pd

In [2]:
df = pd.read_json('data/studentmarks.json')

In [4]:
df.to_string()

"                                                                                                                             students\n0    {'id': 1, 'name': 'Arun Kumar', 'class': '10A', 'marks': {'maths': 85, 'science': 90, 'english': 78, 'social': 88, 'tamil': 92}}\n1  {'id': 2, 'name': 'Priya Sharma', 'class': '10A', 'marks': {'maths': 95, 'science': 89, 'english': 82, 'social': 91, 'tamil': 87}}\n2      {'id': 3, 'name': 'Ravi Raj', 'class': '10B', 'marks': {'maths': 76, 'science': 72, 'english': 80, 'social': 85, 'tamil': 90}}"

# use of json_normalize

    # df = pd.json_normalize(df["students"], sep="_")

In [ ]:
df = pd.json_normalize(df["students"], sep="_")

,id,name,class,marks_maths,marks_science,marks_english,marks_social,marks_tamil
0,1,Arun Kumar,10A,85,90,78,88,92
1,2,Priya Sharma,10A,95,89,82,91,87
2,3,Ravi Raj,10B,76,72,80,85,90

# alternate to json_normalize

In [13]:
df_01 = pd.read_json('data/studentmarks.json')
df_01.head()

                                            students
0  {'id': 1, 'name': 'Arun Kumar', 'class': '10A'...
1  {'id': 2, 'name': 'Priya Sharma', 'class': '10...
2  {'id': 3, 'name': 'Ravi Raj', 'class': '10B', ...

In [16]:
import json
# Empty list to collect flattened records
normalized_data = []

# Loop through each student and flatten manually
for student in df_01["students"]:
    flat_record = {
        "id": student["id"],
        "name": student["name"],
        "class": student["class"]
    }
    
    # Add marks to the flat record
    for subject, score in student["marks"].items():
        flat_record[subject] = score
    
    # Add the flat record to our list
    normalized_data.append(flat_record)

# # Convert to DataFrame
df = pd.DataFrame(normalized_data)

# # Display the result
print(df)

   id          name class  maths  science  english  social  tamil
0   1    Arun Kumar   10A     85       90       78      88     92
1   2  Priya Sharma   10A     95       89       82      91     87
2   3      Ravi Raj   10B     76       72       80      85     90

In [15]:
flat_record

{'id': 3,
 'name': 'Ravi Raj',
 'class': '10B',
 'maths': 76,
 'science': 72,
 'english': 80,
 'social': 85,
 'tamil': 90}

# another dataset to explore all the arguments under read_csv() method

In [17]:
import pandas as pd
from datetime import datetime

# custom date parser
dateparse = lambda x: datetime.strptime(x, "%d-%m-%Y") if "-" in x else pd.to_datetime(x)

In [ ]:
from dateutil import parser

# Custom date parser function using dateutil.parser
# It parses date strings with dayfirst format and strips whitespace
dateparse = lambda x: parser.parse(x.strip(), dayfirst=True)

# Read CSV file with various options to handle complex data
df = pd.read_csv(
    "data/sample_data.csv",                # Path to the CSV file
    sep="|",                              # Use '|' as column separator
    header=0,                             # First row contains column names
    names=["emp_id", "full_name", "age", "salary", "join_date", "active", "notes"],  # Explicit column names
    index_col="emp_id",                   # Set 'emp_id' as index
    usecols=["emp_id", "full_name", "age", "salary", "join_date", "active"],         # Only read these columns
    dtype={"age": "float64"},             # Set 'age' column type to float
    na_values=["NA", "N/A", "-", " NA ", "NA ", " N/A "],  # Treat these as missing values
    skipinitialspace=True,                # Ignore spaces after delimiter
    thousands=",",                        # Handle thousands separator in numbers
    decimal=".",                          # Decimal point character
    parse_dates=["join_date"],            # Parse 'join_date' as datetime
    date_parser=dateparse,                # Use custom date parser for dates
    true_values=["YES", "TRUE"],          # Values to interpret as True
    false_values=["NO", "FALSE"],         # Values to interpret as False
    comment="#",                          # Ignore lines starting with '#'
    on_bad_lines="warn",                  # Warn if there are malformed lines
    encoding="utf-8"                      # File encoding
)

C:\Users\Laptop\AppData\Local\Temp\ipykernel_14644\3070291560.py:5: FutureWarning: The argument 'date_parser' is deprecated and will be removed in a future version. Please use 'date_format' instead, or read your data in as 'object' dtype and then call 'to_datetime'.
  df = pd.read_csv(

In [23]:
df.head()

                full_name   age        salary  join_date  active
emp_id
1            Arun, Kumar   28.0    50,000.50  2020-02-01    YES
2           Priya Sharma    NaN    75,000.00  2021-03-15     NO
3       Mohan \Mo\" Raj"   35.0  1,20,000.75  2020-01-07   TRUE
4            Karthick AG   42.0          N/A  2021-12-31  FALSE